Examinator/src/Enums/ЦелевыеОкнаДляСсылокСУЗ/ЦелевыеОкнаДляСсылокСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦелевыеОкнаДляСсылокСУЗ</name>
  <comment>Список окон в которых могут открываться ссылки</comment>
  <enumValues>
    <name>this</name>
  </enumValues>
  <enumValues>
    <name>new</name>
  </enumValues>
  <enumValues>
    <name>main</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/РесурсыОбъектовСУЗ/РесурсыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РесурсыОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/ГиперссылкаНаОбъектСУЗ/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполняем переменные формы
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйРесурс) Тогда
		ЭлектронныйРесурс = Параметры.ЭлектронныйРесурс;
	КонецЕсли;
	
	СформироватьТаблицуСкрытыхРесурсов();
	
	Если ЗначениеЗаполнено(Параметры.Гиперссылка) Тогда
		
		СтруктураСсылки = ОбъектыСУЗКлиентСервер.СтруктураСтрокиПараметров(Параметры.Гиперссылка, "?");
		
		Действие = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "action");
		ИдентификаторОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "id");
		ИмяОбъекта = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "object");
		ИдентификаторЭлементаСодержания = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "item");
		ЭтоСкрытыйРесурс = ОбщегоНазначенияСУКлиентСервер.СтрокаВБулево(ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "isHiddenRes"));
		
		
		ГиперссылкаНайдена = Ложь;
		
		// Ищем элемент содержания
		
		Если НЕ ГиперссылкаНайдена И (ЗначениеЗаполнено(ИдентификаторЭлементаСодержания) ИЛИ Действие = "openKnowledgeBaseElementLink" ) Тогда
			
			Если ЗначениеЗаполнено(ИдентификаторЭлементаСодержания) Тогда
				ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЭлементаСодержания));
			Иначе
				ЭлементСодержания = Справочники.СодержаниеСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторОбъекта));
			КонецЕсли;
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(ЭлементСодержания, Истина) Тогда
			
				ТекущийЭлементСодержания = ЭлементСодержания;
				ЭлектронныйРесурс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийЭлементСодержания, "Владелец");
				Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЭлементыКурсов;
				УстановитьУсловноеОформлениеСписков(ЭлементыСодержания, ТекущийЭлементСодержания);
				Элементы.ЭлементыСодержания.ТекущаяСтрока = ТекущийЭлементСодержания;			
				
				ГиперссылкаНайдена = Истина;
				
			КонецЕсли;
				
			
		КонецЕсли;
		
		// Ищем скрытый ресурс
		
		Если НЕ ГиперссылкаНайдена И ЭтоСкрытыйРесурс = Истина И ЗначениеЗаполнено(ИмяОбъекта) И ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
			
			СсылкаНаРесурс = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, ИдентификаторОбъекта);
			
			Если ОбщегоНазначенияСУКлиентСервер.СсылкаСуществуетВБазе(СсылкаНаРесурс, Истина) Тогда
			
				СтрокаВСкрытых = СкрытыеРесурсы.НайтиСтроки(Новый Структура("РесурсДляПросмотра", СсылкаНаРесурс));
				
				Если СтрокаВСкрытых.Количество() > 0 Тогда
					
					ТекущийСкрытыйРесурс = СсылкаНаРесурс;
					Элементы.СкрытыеРесурсы.ТекущаяСтрока = СкрытыеРесурсы.Индекс(СтрокаВСкрытых[0]);
					Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЭлементыКурсов;
					Элементы.СтраницыЭлементыКурса.ТекущаяСтраница = Элементы.СтраницаСкрытыеРесурсы;
					
					ГиперссылкаНайдена = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
				
		КонецЕсли;
		
		Если НЕ ГиперссылкаНайдена И ЗначениеЗаполнено(ИмяОбъекта) И ЗначениеЗаполнено(ИдентификаторОбъекта) Тогда
			
			СсылкаНаОбъектСУЗ = ОбъектыСУЗ.ПолучитьСсылкуПоИдентификатору(ИмяОбъекта, ИдентификаторОбъекта);
			
			Если ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
				ИдентификаторСтраницы = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "idGroup");
				Если ЗначениеЗаполнено(ИдентификаторСтраницы) Тогда
					СтраницаОбъектаСУЗ = Справочники.ЭлементыПодборкиСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторСтраницы));
				КонецЕсли;				
			КонецЕсли;
			
			ЦелевоеОкно = ОбъектыСУЗКлиентСервер.ПолучитьЗначениеПараметраСсылки(СтруктураСсылки, "window");

			ОкноОткрытияСсылки = Перечисления.ЦелевыеОкнаДляСсылокСУЗ[ЦелевоеОкно];
			
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЭлементыСправочников;			
			
			ГиперссылкаНайдена = Истина;
			
		КонецЕсли;
		
		Если НЕ ГиперссылкаНайдена И Действие = "openTip" Тогда
			
			ТекущаяПодсказка = Справочники.РесурсыОбъектовСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторОбъекта));
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПодсказки;
			УстановитьУсловноеОформлениеСписков(Подсказки, ТекущаяПодсказка);
			Элементы.Подсказки.ТекущаяСтрока = ТекущаяПодсказка;
			
			ГиперссылкаНайдена = Истина;
			
		КонецЕсли;
		
		Если НЕ ГиперссылкаНайдена Тогда 
			
			ВнешняяГиперссылка = Параметры.Гиперссылка;
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВнешняя;
			
			ГиперссылкаНайдена = Истина;
			
		КонецЕсли;			
		
	КонецЕсли;	
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЭлементыСодержания, ЭлектронныйРесурс);
	
	// Устанавливаем видимость элементов
	
	Элементы.СтраницаПодсказки.Видимость = ЗначениеЗаполнено(Параметры.ОбъектВладелец);
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Подсказки, Параметры.ОбъектВладелец);
	
	Элементы.СтраницаОбъектаСУЗ.Доступность = ЗначениеЗаполнено(СтраницаОбъектаСУЗ) И ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ПодборкиСУЗ") И ЗначениеЗаполнено(СсылкаНаОбъектСУЗ);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЭлектронныйРесурсПриИзменении(Элемент)
	
	ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ЭлементыСодержания, ЭлектронныйРесурс);
	
	СформироватьТаблицуСкрытыхРесурсов();
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаОбъектСУЗПриИзменении(Элемент)

	СтраницаОбъектаСУЗ = Неопределено;
	
	Если ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
		
		Элементы.СтраницаОбъектаСУЗ.Доступность = Истина;
		
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(Новый ПараметрВыбора("Отбор.Владелец", СсылкаНаОбъектСУЗ));
		
		Элементы.СтраницаОбъектаСУЗ.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
	Иначе
		
		Элементы.СтраницаОбъектаСУЗ.Доступность = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЭлементыСодержания

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ЭлементыСодержания

&НаКлиенте
Процедура ЭлементыСодержанияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Закрыть(ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Значение, ?(ЗначениеЗаполнено(ОкноОткрытияСсылки), ОкноОткрытияСсылки, "")));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодсказки

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ Подсказки

&НаКлиенте
Процедура ПодсказкиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Закрыть(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
		
		Отказ = Истина;
		
		ОткрытьФорму("Справочник.РесурсыОбъектовСУЗ.ФормаОбъекта", Новый Структура("ЭтоПодсказка, ЗначенияЗаполнения", Истина, Новый Структура("Владелец", Параметры.ОбъектВладелец)), Элемент);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСкрытыеРесурсы

// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СкрытыеРесурсы

&НаКлиенте
Процедура СкрытыеРесурсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаСР = СкрытыеРесурсы.Получить(ВыбраннаяСтрока);
	
	Закрыть(АдресСкрытогоРесурса(СтрокаСР.РесурсДляПросмотра, ОкноОткрытияСсылки));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьЭлементСправочника(Команда)
	Закрыть(АдресЭлементаСправочника());
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВнешнююГиперссылку(Команда)
	Закрыть(ВнешняяГиперссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСсылкуНаЭлементСправочника(Команда)
	СсылкаНаЭлементСправочника = АдресЭлементаСправочника();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция АдресЭлементаСправочника()
	
	Если ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
		
		ИдентификаторОбъекта = Строка(СсылкаНаОбъектСУЗ.УникальныйИдентификатор());
		
		Если ТипЗнч(СсылкаНаОбъектСУЗ) = Тип("СправочникСсылка.ПодборкиСУЗ")
			И ЗначениеЗаполнено(СтраницаОбъектаСУЗ)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтраницаОбъектаСУЗ, "Владелец") = СсылкаНаОбъектСУЗ Тогда
			
			Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СтраницаОбъектаСУЗ, ?(ЗначениеЗаполнено(ОкноОткрытияСсылки), ОкноОткрытияСсылки, Перечисления.ЦелевыеОкнаДляСсылокСУЗ.this),,Новый Структура("ПривязатьКИдентификаторуЭлементаПодборки", Истина));
			
		Иначе
			
			Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(СсылкаНаОбъектСУЗ, ?(ЗначениеЗаполнено(ОкноОткрытияСсылки), ОкноОткрытияСсылки, Перечисления.ЦелевыеОкнаДляСсылокСУЗ.this));
			
		КонецЕсли;
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
	
КонецФункции

&НаСервереБезКонтекста
Функция АдресСкрытогоРесурса(Ресурс, ОкноОткрытияСсылки)
	
	Возврат ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Ресурс, ?(ЗначениеЗаполнено(ОкноОткрытияСсылки), ОкноОткрытияСсылки, Перечисления.ЦелевыеОкнаДляСсылокСУЗ.this),,Новый Структура("ЭтоСкрытыйРесурс", Истина));
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформлениеСписков(ДинамическийСписок, ПравоеЗначение)
	
	НовоеОформление = ДинамическийСписок.УсловноеОформление.Элементы.Добавить();
	НовоеОформление.Использование = Истина;
	НовоеОформление.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный; 
	НовоеОформление.ПредставлениеПользовательскойНастройки = "Текущая ссылка"; 

	ЭлементЦветаОформления = НовоеОформление.Оформление.Элементы.Найти("Font");
	ЭлементЦветаОформления.Значение = Новый Шрифт(, , Истина);
	ЭлементЦветаОформления.Использование = Истина;			

	Отбор = НовоеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Отбор.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.Использование    = Истина;
	Отбор.Представление    = "Ссылка";
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Отбор.ПравоеЗначение   = ПравоеЗначение;	
	
КонецПроцедуры

&НаСервере
Процедура СформироватьТаблицуСкрытыхРесурсов()
	
	СкрытыеРесурсы.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат;		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ресурс
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ.СкрытыеРесурсы КАК СводыЗнанийСУЗСкрытыеРесурсы
		|ГДЕ
		|	СводыЗнанийСУЗСкрытыеРесурсы.Ссылка = &ЭлектронныйРесурс
		|
		|УПОРЯДОЧИТЬ ПО
		|	СводыЗнанийСУЗСкрытыеРесурсы.НомерСтроки";
	
	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = СкрытыеРесурсы.Добавить();
		НоваяСтрока.Ресурс = ВыборкаДетальныеЗаписи.Ресурс;
		НоваяСтрока.РесурсДляРедактирования = Справочники.СводыЗнанийСУЗ.СкрытыйРесурсДляРедактирования(ВыборкаДетальныеЗаписи.Ресурс);
		НоваяСтрока.ТипРесурсаДляРедактирования = Справочники.СводыЗнанийСУЗ.ТипСкрытогоРесурсаДляРедактирования(НоваяСтрока.РесурсДляРедактирования);
		НоваяСтрока.РесурсДляПросмотра = Справочники.СводыЗнанийСУЗ.СкрытыйРесурсДляПросмотра(ВыборкаДетальныеЗаписи.Ресурс);
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти
